
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокДоговоры.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
	Элементы.КПП.Видимость = Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	
	ТекущиеДанные = Элементы.СписокДоговоры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = "Выберите договор!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ДоговорКонтрагента = ТекущиеДанные.Ссылка;
	ТипЦен = ПолучитьТипЦенДоговора(ДоговорКонтрагента);
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
	  	ТипЦен = ПолучитьТипЦенПоУмолчанию();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Объект.Ссылка);
	ПараметрыФормы.Вставить("ДоговорКонтрагента", ТекущиеДанные.Ссылка);
	ПараметрыФормы.Вставить("ТипЦен", ТипЦен);
	
	ОткрытьФорму("Документ.Заказ.ФормаОбъекта", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТипЦенДоговора(ДоговорКонтрагента)
	
	Возврат ДоговорКонтрагента.ТипЦен;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипЦенПоУмолчанию()
	
	Возврат ПолучитьФункциональнуюОпцию("ТипЦенНоменклатурыМобильногоКлиента");	
	
КонецФункции

#КонецОбласти