
#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаДанныхИзЦентральнойБазыОбработчикЗадания() Экспорт
	
  	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ЗагрузкаДанныхИзЦентральнойБазы);
	
	ЗагрузкаДанныхИзЦентральнойБазы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузкаДанныхИзЦентральнойБазы()

	ИнициированаОчисткаБазы = 
		ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ИнициированаОчисткаБазы");
		
	Если ИнициированаОчисткаБазы Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняем проверку, выполнялась синхронизация хотя бы один раз или нет
	ДатаПоследнегоОбновления = 
		ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ДатаПоследнегоОбновления");

	Если ЗначениеЗаполнено(ДатаПоследнегоОбновления) Тогда
		
		ПараметрыЗапуска = Новый Структура();
		ПараметрыЗапуска.Вставить("РежимСинхронизации", "ВыполнитьСинхронизацию");
		ПараметрыЗапуска.Вставить("ДатаНачалаСинхронизации", ТекущаяДата());
		ПараметрыЗапуска.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
		ФоновоеЗаданиеИдентификатор = УникальныйИдентификаторПустой();
		ФоновоеЗаданиеАдресХранилища = "";
		
		ОбменВызовСервера.ЗапуститьСинхронизациюССерверомВФоне(
			ПараметрыЗапуска, ФоновоеЗаданиеИдентификатор, ФоновоеЗаданиеАдресХранилища);
		
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти