
#Область ПрограммныйИнтерфейс

// Удаляет все данные на устройстве, приводя базу в исходное состояние.
//
Процедура УдалитьВсеДанные() Экспорт

	////Перед запуском удаления всех данных необходимо отменить
	////задание очистки от устаревших данных, если оно активно
	ОчисткаБазыДанныхВызовСервера.ПрерватьОчисткуОтСтарыхДанныхВФоне();
	
	Константы.ИнициированаОчисткаБазы.Установить(Истина);
	
	Для Каждого Эл Из Метаданные.Справочники Цикл

		Выборка = Справочники[Эл.Имя].Выбрать();
		Пока Выборка.Следующий() Цикл

			Если Выборка.Предопределенный Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗНЧ(Выборка) = Тип("СправочникСсылка.Пользователи") Тогда  // ПМВ
				Продолжить;
			КонецЕсли;

			УдалитьОбъект(Выборка.ПолучитьОбъект());

		КонецЦикла;

	КонецЦикла;

	Для Каждого Эл Из Метаданные.Документы Цикл

		Выборка = Документы[Эл.Имя].Выбрать();
		Пока Выборка.Следующий() Цикл
			УдалитьОбъект(Выборка.ПолучитьОбъект());
		КонецЦикла;

	КонецЦикла;

	Для Каждого Эл Из Метаданные.РегистрыСведений Цикл
		НаборЗаписей = РегистрыСведений[Эл.Имя].СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЦикла;

	Для Каждого Эл Из Метаданные.ПланыОбмена Цикл

		ЭтотУзел = ПланыОбмена[Эл.Имя].ЭтотУзел();

		Выборка  = ПланыОбмена[Эл.Имя].Выбрать();
		Пока Выборка.Следующий() Цикл

			Если Выборка.Ссылка = ЭтотУзел Тогда
				Продолжить;
			КонецЕсли;

			УдалитьОбъект(Выборка.ПолучитьОбъект());

		КонецЦикла;

	КонецЦикла;

	Константы.ДатаПоследнегоОбновления.Установить(Дата(1, 1, 1));
	Константы.ЕстьНеотправленныеДанные.Установить(Ложь);
	Константы.КодУстройства.Установить(Строка(Новый УникальныйИдентификатор()));
	Константы.СессияСинхронизации.Установить(0);
	Константы.ПоследняяОтправленнаяНаСерверЗаписьПротокола.Установить(0);

	Константы.ИспользуемаяВерсияФорматаОбмена.Установить("");

	ОбменВызовСервера.СброситьСостояниеЗагрузкиЧастейСообщений();
	ОбновитьПовторноИспользуемыеЗначения();

	Константы.ИнициированаОчисткаБазы.Установить(Ложь);
	
КонецПроцедуры

// Выполняет очистку базы от данных находящихся за границами устаревания.
//
Процедура ВыполнитьОчисткуОтСтарыхДанных() Экспорт

	Попытка
		УдалитьФайлы(ПараметрыСеанса.ПутьКаталогаФайлов);
	Исключение

		Инфо = ИнформацияОбОшибке();

		ТекстПредупреждения = 
			РаботаСоСтрокамиКлиентСервер.СформироватьПредставлениеОшибки(
				НСтр("ru = 'При удалении временных файлов произошла ошибка.'
					|; en = 'Cannot delete temporary files.'"), 
				ПодробноеПредставлениеОшибки(Инфо));
				
		РаботаСПротоколомСобытийВызовСервера.ДобавитьПредупреждение(ТекстПредупреждения);

	КонецПопытки;

	Константы.ИдентификаторПоследнегоЗагруженногоСообщения.Установить(УникальныйИдентификаторПустой());
	Константы.НомерПоследнейЗагруженнойЧастиСообщения.Установить(0);

КонецПроцедуры

// Запускает очистку базы от устаревших данных в фоновом режиме
//
Функция ЗапуститьОчисткуОтСтарыхДанныхВФоне() Экспорт
	
	ИмяФоновогоЗадания = "ВыполнитьОчисткуОтСтарыхДанных";
	
	// Проверим наличие активного задания синхронизации.
	ОтборЗаданий = Новый Структура();
	ОтборЗаданий.Вставить("Наименование", ИмяФоновогоЗадания);
	ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);

	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
	Если Не Задания.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить("ОчисткаБазыДанныхВызовСервера.ВыполнитьОчисткуОтСтарыхДанных", , , ИмяФоновогоЗадания);
		
	Возврат Истина
	
КонецФункции

// Прерывает очистку базы от устаревших данных в фоновом режиме
Процедура ПрерватьОчисткуОтСтарыхДанныхВФоне() Экспорт
	
	ИмяФоновогоЗадания = "ВыполнитьОчисткуОтСтарыхДанных";
	
	// Проверим наличие активного задания синхронизации.
	ОтборЗаданий = Новый Структура();
	ОтборЗаданий.Вставить("Наименование", ИмяФоновогоЗадания);
	ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);

	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
	Для Каждого Задание Из Задания Цикл
		Задание.Отменить();	
	КонецЦикла;	
		
КонецПроцедуры

// Очищает регистр загруженных частей сообщений.
//
Процедура ОчиститьПринятыеДанные() Экспорт

	НаборЗаписей = РегистрыСведений.ПолученныеДанныеОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();

КонецПроцедуры

// Дожидается окончания процесса отключения от сервера
//
// Параметры:
//  ИмяЗадания - Строка - Имя фонового задания.
//
Процедура ДождатьсяОкончанияПроцессаОтключенияОтСервера(ИмяЗадания) Экспорт

	Отбор = Новый Структура("Наименование", ИмяЗадания);

	// Находим задание. 
	// Т.к. оно к этому моменту может и не запуститься, ждем начала его работы.

	ЗаданиеЗавершено = Ложь;
	Пока Не ЗаданиеЗавершено Цикл

		Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);

		Если Не Задания.Количество() = 0 
			И Не Задания[0].Состояние = СостояниеФоновогоЗадания.Активно Тогда

			ЗаданиеЗавершено = Истина;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Удаляет непосредственное удаление объекта из базы данных.
//
// Параметры:
//  Объект - Ссылка - Ссылка на удаляемый объект.
//
Процедура УдалитьОбъект(Объект)

	Попытка
		Объект.ДополнительныеСвойства.Вставить("ОчисткаБазы");
		Объект.Удалить();
	Исключение
		// Ситуация ошибочная, и такого быть не должно, но ничего не делаем.
		Инфо = ИнформацияОбОшибке();
	КонецПопытки;

КонецПроцедуры

// Удалить объект по истечению срока хранения
//
// Параметры:
//  ЦентральныйУзелОбмена - ПланОбменаСсылка.Мобильный - Ссылка на узел обмена с сервером;
//  Объект				  - Ссылка - Ссылка на удаляемый объект.
//
Процедура УдалитьОбъектПоИстечениюСрокаХранения(ЦентральныйУзелОбмена, Объект)

	Идентификатор = Объект.УникальныйИдентификатор();
	ТипОбъекта = ТипЗнч(Объект);

	Попытка

		УдалениеДанных = Новый УдалениеОбъекта(Объект);
		УдалениеДанных.Записать();

		ПланыОбмена.УдалитьРегистрациюИзменений(ЦентральныйУзелОбмена, УдалениеДанных);

		РаботаСПротоколомСобытийВызовСервера.ДобавитьЗаписьРасширенногоПротокола(Объект, 
			НСтр("ru = 'Объект подвержен процедуре очистки от старых данных'
			|; en = 'The object is subject to procedure of cleaning of old data'"));

	Исключение

		РаботаСПротоколомСобытийВызовСервера.ДобавитьИнформациюПоОбъекту(
			НСтр("ru = 'Не удалось удалить объект'; en = 'Can''t delete the object'"), 
			ТипОбъекта, Идентификатор);

	КонецПопытки;

КонецПроцедуры

#КонецОбласти