
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтрокаТаб = ТаблицаКоманд.Добавить();
	СтрокаТаб.Команда = "СайтВизард";
	СтрокаТаб.ОписаниеКоманды = 
		НСтр("ru = 'Сайт группы компаний ""Визард""'");
	СтрокаТаб.Пояснение = 
		НСтр("ru = 'Посетите сайт группы компаний ""Визард""'");
		
	СтрокаТаб = ТаблицаКоманд.Добавить();
	СтрокаТаб.Команда = "СтраницаInstagram";
	СтрокаТаб.ОписаниеКоманды = 
		НСтр("ru = 'Наша страница в Instagram'");
	СтрокаТаб.Пояснение = 
		НСтр("ru = 'Посетите страницу ГК ""Визард"" в Instagram'");
		
	СтрокаТаб = ТаблицаКоманд.Добавить();
	СтрокаТаб.Команда = "ГруппаFacebook";
	СтрокаТаб.ОписаниеКоманды = 
		НСтр("ru = 'Наша группа в Facebook'");
	СтрокаТаб.Пояснение = 
		НСтр("ru = 'Присоединяйтесь к живому общению в социальной сети Facebook.'");

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()

	ПараметрыЭкрана = ЭкранКлиентСервер.ПараметрыЭкрана();
	ШиринаЭкрана    = ПараметрыЭкрана[0].Ширина;
	ВысотаЭкрана    = ПараметрыЭкрана[0].Высота;
	
	Если ШиринаЭкрана > ВысотаЭкрана Тогда
		Элементы.ТаблицаКомандПояснение.Высота = 2;
	Иначе
		Элементы.ТаблицаКомандПояснение.Высота = 3;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаКомандВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.ТаблицаКоманд.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;                                              

	Если ТекущиеДанные.Команда = "СайтВизард" Тогда
		ЗапуститьПриложение("https://wizard-c.ru/");
		
	ИначеЕсли ТекущиеДанные.Команда = "СтраницаInstagram" Тогда
		ЗапуститьПриложение("https://www.instagram.com/wizard_tver/");
		
	ИначеЕсли ТекущиеДанные.Команда = "ГруппаFacebook" Тогда
		ЗапуститьПриложение("https://www.facebook.com/wizard.mercury/");

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
