
#Область ПрограммныйИнтерфейс

// Обработчик открытия гиперссылки в тексте.
//
// Параметры:
//  Гиперссылка			 - Строка - Анализируемая гиперссылка;
//  СтандартнаяОбработка - Булево - Признак стандартной обработки;
//  Объект				 - СправочникСсылка.Файлы - Ссылка на открываемый файл.
//
Процедура ОткрытьСсылку(Гиперссылка, СтандартнаяОбработка, Объект = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Гиперссылка) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	СхемаСсылки = РаботаСHTMLКлиентСервер.ОпределитьСхемуСсылки(Гиперссылка);
	
	Если СхемаСсылки = "http://"
		Или СхемаСсылки = "https://"
		Или СхемаСсылки = "ftp://" Тогда
		
		ЗапуститьПриложение(Гиперссылка);
		
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
