
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает дату выгрузки объекта для отправки на сервер.
//
// Параметры:
//  Объект - СправочникСсылка, ДокументСсылка - Ссылка на обрабатываемый объект.
//
Процедура УстановитьДатуВыгрузки(Объект) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДатыВыгрузкиОбъектовНаСервер.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Объект       = Объект;
	МенеджерЗаписи.ДатаВыгрузки = ТекущаяДата();

	МенеджерЗаписи.Записать();

КонецПроцедуры

// Проверяет, выгружался ли объект для отправки на сервер.
//
// Параметры:
//  Объект - СправочникСсылка, ДокументСсылка - Ссылка на обрабатываемый объект.
// 
// Возвращаемое значение:
//  Истина - Если объект выгружался на сервер.
//
Функция ОбъектВыгружалсяНаСервер(Объект) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДатыВыгрузкиОбъектовНаСервер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Прочитать();

	Возврат МенеджерЗаписи.Выбран();

КонецФункции

#КонецОбласти

#КонецЕсли

