#Область ПрограммныйИнтерфейс

// Задел на перспективу. В текущей реализации регистры на клиенте не изменяются
// и в центральную базу не передаются
//
// Возвращает полное имя регистра на клиента
// Например 
// Параметры:
//  ПолноеИмяРегистраВЦентральнойБазе  - Строка - например,
//                 РегистрСведений.ЦеныНоменклатуры
//
// Возвращаемое значение:
//   ПолноеИмяРегистраНаКлиенте - Строка - например, 
//                 РегистрСведений.ЦеныНоменклатуры
// Обратить внимание - РегистР, а не РегистрЫ
//
Функция ПолучитьПолноеИмяРегистраНаКлиенте(ПолноеИмяРегистраВЦентральнойБазе) Экспорт
	
	Если ПолноеИмяРегистраВЦентральнойБазе = "РегистрСведений.wЦеныНоменклатурыМобильныйКлиентИзмененные"  Тогда
		ПолноеИмяРегистраНаКлиенте = "РегистрСведений.ЦеныНоменклатуры";       
		
	ИначеЕсли ПолноеИмяРегистраВЦентральнойБазе = "РегистрСведений.wТоварыОстаткиОбменМобильныйКлиентИзмененные" Тогда	
		ПолноеИмяРегистраНаКлиенте = "РегистрСведений.ТоварыОстатки";       
		
	Иначе
		ТекстСообщения = "Не определено соответствие 
		|регистру " + ПолноеИмяРегистраВЦентральнойБазе + "
		|в модуле ОбменОбработкаСерверПовтИспПереопределяемый";
		РегистрыСведений.ПротоколСобытий.ДобавитьОшибку(ТекстСообщения);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Обмен с мобильным.Обработка сообщения.Ошибка'", Метаданные.ОсновнойЯзык.КодЯзыка),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстСообщения);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Проверяем есть ли такой регистр на клиенте
	Если Метаданные.НайтиПоПолномуИмени(ПолноеИмяРегистраНаКлиенте) <> Неопределено Тогда
		Возврат ПолноеИмяРегистраНаКлиенте;
	Иначе
		
		ТекстСообщения = "Некорректно определено соответствие 
		|регистру " + ПолноеИмяРегистраВЦентральнойБазе + "
		|в модуле ОбменОбработкаСерверПовтИспПереопределяемый";
		РегистрыСведений.ПротоколСобытий.ДобавитьОшибку(ТекстСообщения);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Обмен с мобильным.Обработка сообщения.Ошибка'", Метаданные.ОсновнойЯзык.КодЯзыка),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстСообщения);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти