
#Область ПрограммныйИнтерфейс

// Формирует заголовок "Объект изменен на клиенте" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ТекстПротоколаОбъектИзмененНаКлиенте() Экспорт
	
	Возврат НСтр("ru = 'Объект изменен на клиенте'; 
				 |en = 'The object is modified on the client'");

КонецФункции

// Формирует заголовок "Загружено изменение объекта" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ТекстПротоколаЗагруженоИзменениеОбъекта() Экспорт

	Возврат НСтр("ru = 'Загружено изменение объекта'; 
				 |en = 'The new version is loaded'");

КонецФункции

// Формирует заголовок "Загружен новый объект" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ТекстПротоколаЗагруженНовыйОбъект() Экспорт

	Возврат НСтр("ru = 'Загружен новый объект'; 
				 |en = 'The new object is loaded'");

КонецФункции

// Формирует заголовок "Создан новый объект" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ТекстПротоколаСозданНовыйОбъект() Экспорт

	Возврат НСтр("ru = 'Создан новый объект'; 
				 |en = 'The new object is created'");

КонецФункции

// Формирует заголовок "В файле обнаружен объект" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ТекстПротоколаВФайлеОбнаруженОбъект() Экспорт

	Возврат НСтр("ru = 'В файле обнаружен объект'; en = 'Object found'");

КонецФункции

// Формирует заголовок "В файле обнаружен объект, но ссылка не получена" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ТекстПротоколаВФайлеОбнаруженОбъектНоСсылкаНеПолучена() Экспорт

	Возврат НСтр("ru = 'В файле обнаружен объект, но ссылка не получена';
				 |en = 'Object found, but the ref isn''t received'");

КонецФункции

// Формирует заголовок "Объект помещен в исходящее сообщение" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок..
//
Функция ТекстПротоколаОбъектПомещенВСообщение() Экспорт

	Возврат НСтр("ru = 'Объект помещен в исходящее сообщение'; en = 'Object placed in file'");

КонецФункции

// Формирует заголовок "Контрагенты" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок..
//
Функция ЗаголовокКонтрагенты() Экспорт

	Возврат НСтр("ru = 'Контрагенты'; en = 'Сounterparties'");

КонецФункции

// Формирует заголовок "Заказы" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок..
//
Функция ЗаголовокЗаказы() Экспорт

	Возврат НСтр("ru = 'Заказы'; en = 'Orders'");

КонецФункции

// Формирует заголовок "Номенклатура" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок..
//
Функция ЗаголовокНоменклатура() Экспорт
	Возврат НСтр("ru = 'Товары'; en = 'Products'");
КонецФункции

// Формирует заголовок "Корзина" на языке системы. 
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок..
//
Функция ЗаголовокКорзина() Экспорт
	Возврат НСтр("ru = 'Корзина'; en = 'Basket'");
КонецФункции

// Формирует заголовок "Продолжить" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыПродолжить() Экспорт

	Возврат НСтр("ru = 'Продолжить'; en = 'Continue'");

КонецФункции

// Формирует заголовок "Остановить" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыОстановить() Экспорт

	Возврат НСтр("ru = 'Остановить'; en = 'Pause'");

КонецФункции

// Формирует заголовок "Сохранить" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыСохранить() Экспорт

	Возврат НСтр("ru = 'Сохранить'; en = 'Save'");

КонецФункции

// Формирует заголовок "Не сохранять" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыНеСохранять() Экспорт

	Возврат НСтр("ru = 'Не сохранять'; en = 'Don't save'");

КонецФункции

// Формирует заголовок "Удалить" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыУдалить() Экспорт

	Возврат НСтр("ru = 'Удалить'; en = 'Delete'");

КонецФункции 

// Формирует заголовок "Не удалять" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыНеУдалять() Экспорт

	Возврат НСтр("ru = 'Не удалять'; en = 'Cancel'");

КонецФункции 

// Формирует заголовок "Красный" на языке системы.
// 
// Возвращаемое значение:
//  Строка - Сформированный заголовок.
//
Функция ЗаголовокКомандыОчистить() Экспорт

	Возврат НСтр("ru = 'Очистить'; en = 'Clean'");

КонецФункции

#КонецОбласти